# Python-Powered Excel

For this small project

I work for a small Northeastern Pennsylvania paper company. Every week you have to send reports to Corporate that include data from Sales, Accounting, Supply, and Human Resources. Those reports come individually from four different department heads: Dwight, Angela, Daryl, and Toby.

Each one of them has their own particular format that fits the need of their department, but none of them look how Corporate wants the final report to look.
I'll be taking those individual reports and ultimately compiling them into the final report for Corporate.

# The Sales Report

In [4]:
#Importing libraries
# xlsxwriter: this is the tool we'll use to write our data to Excel.
# os: This is a Python module that lets us naviagte files and folders on our operating system.

import pandas as pd
import xlsxwriter
import os

In [2]:
#If you don't have xlsxwriter then install by typing this command in notebook

!pip install XlsxWriter

Collecting XlsxWriter
  Downloading https://files.pythonhosted.org/packages/21/48/05167e0aa3294eec000b066f5be5b5ad42c6da686ae6a2c4f61164461c96/XlsxWriter-1.2.0-py2.py3-none-any.whl (140kB)
Installing collected packages: XlsxWriter
Successfully installed XlsxWriter-1.2.0

In [5]:
# Show our current working folder
os.getcwd()

'C:\\Users\\ASUS\\Desktop\\DataScienceBooks\\conference\\training @safari\\python-powered-excel'

In [6]:
# The files in this folder
os.listdir()

['.git', '.ipynb_checkpoints', 'data', 'README.md', 'Sales.ipynb']

In [8]:
# The files in the main folder
main_dir = os.path.join('.')
os.listdir(main_dir)

['.git', '.ipynb_checkpoints', 'data', 'README.md', 'Sales.ipynb']

In [9]:
# The files in the data folder 
data_dir = os.path.join('.', 'data')
os.listdir(data_dir)

['accounting.xlsx',
 'accounting_summary_master.xlsx',
 'combined_report.xlsx',
 'hr_report.xlsx',
 'hr_summary_master.xlsx',
 'sales.csv',
 'supply.xlsx',
 'supply_summary_master.xlsx']

In [10]:
# Let's put that altogether and read our file into Pandas

sales_file = os.path.join(data_dir, 'sales.csv')
df = pd.read_csv(sales_file)

In [15]:
df.head(10)

  Worker  Month                 Client   Qty    Amt  Commission
0      J      3             Blue Cross  3000  15000      2250.0
1      J      3           Dunmore High  2000  10000      1500.0
2      J      3    Maguire Advertising  1750   8750      1312.5
3      J      3      Decker Automotive  1000   5000       750.0
4      D      3      Lackawanna County  2000  10000      1500.0
5      D      3   Scranton White Pages  2000  10000      1500.0
6      D      3        Apex Technology   750   3750       562.5
7      D      3  Stone, Cooper, Grandy   500   2500       375.0
8      D      3         Harper Collins  1000   5000       750.0
9      D      3        Prestige Postal   750   3750       562.5

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62 entries, 0 to 61
Data columns (total 6 columns):
Worker        62 non-null object
Month         62 non-null int64
Client        62 non-null object
Qty           62 non-null int64
Amt           62 non-null int64
Commission    62 non-null float64
dtypes: float64(1), int64(3), object(2)
memory usage: 2.5+ KB

In [14]:
df.tail()

   Worker  Month                   Client  Qty   Amt  Commission
57      S      5            Stone and Son  500  2500       375.0
58      A      5                Bob Vance  550  2750       412.5
59      A      5  Scranton Animal Shelter  100   500        75.0
60      A      5                  Cornell    0     0         0.0
61      A      5            Barbara Allen    0     0         0.0

# Replacing Text

Instead of using actual employee names, Dwight only used a single letter to identify them. this happens all the time so we know the employees are as follows:

+ J: Jim
+ D: Dwight
+ P: Phyllis
+ S: Stanley
+ A: Andy

In [16]:
employees = {
    'J': 'Jim',
    'D': 'Dwight',
    'P': 'Phyllis',
    'S': 'Stanley',
    'A': 'Andy'
}

If we were in Excel, we'd do a **find and replace** for each one of those, which would be time-consuming, especially if we had more than a few names to replace. In pandas, we can simply use **replace** to change them all at once.


The **inplace=True** argument tells pandas to overwrite the existing data, rather than just print the result to the screen

In [25]:
df['Worker'].replace(employees, inplace=True)

In [26]:
df.head()

   Worker  Month               Client   Qty    Amt  Commission
0     Jim      3           Blue Cross  3000  15000      2250.0
1     Jim      3         Dunmore High  2000  10000      1500.0
2     Jim      3  Maguire Advertising  1750   8750      1312.5
3     Jim      3    Decker Automotive  1000   5000       750.0
4  Dwight      3    Lackawanna County  2000  10000      1500.0

# Aggregating Data

In [ ]:
sales_by_client = df.groupby(['Client, 'Worker'], as_index=False).\
                               agg({
                                    'Qty':[sum],
                                    'Amt': [sum]
                              
                              })